{
    "choose_language_text": {
        "en": "Please, choose your language:",
        "ru": "Пожалуйста, выберите язык:",
        "hy": "Խնդրում ենք ընտրել ձեր լեզուն:"
    },
    "welcome_message": {
        "en": "Hello, I’m a Practice bot\nYou can:\nGet your first project using /get_project command\nOther commands:\n/help → Help\n/history → Projects history\n/request_portfolio → Request for portfolio and certification.",
        "ru": "Привет, я PracticeBot\nВы можете:\nПолучить свой первый проект командой /get_project\nДругие команды:\n/help → Помощь\n/history → История проектов\n/request_portfolio → Запрос портфолио и сертификата.",
        "hy": "Բարև, ես PracticeBot եմ\nԴուք կարող եք՝\nՍտանալ ձեր առաջին նախագիծը /get_project հրամանով\nԱյլ հրամաններ՝\n/help → Օգնություն\n/history → Նախագծերի պատմություն\n/request_portfolio → Պորտֆոլիոյի և սերտիֆիկատի հարցում."
    },
    "project_text": {
        "en": "Available commands:\n/get_project → Get project\n/project → Check project state\n/finish_project → Finish project",
        "ru": "Доступные команды:\n/get_project → Получить проект\n/project → Проверить состояние проекта\n/finish_project → Завершить проект",
        "hy": "Հասանելի հրամաններ․\n/get_project → Ստանալ նախագիծ\n/project → Ստուգել նախագծի վիճակը\n/finish_project → Ավարտել նախագիծ"
    },
    "button_projects": {
        "en": "Projects",
        "ru": "Проекты",
        "hy": "Նախագծեր"
    },
    "button_get_project": {
        "en": "Get Project",
        "ru": "Получить проект",
        "hy": "Ստանալ նախագիծ"
    },
    "button_help": {
        "en": "Help",
        "ru": "Помощь",
        "hy": "Օգնություն"
    },
    "button_history": {
        "en": "History",
        "ru": "История",
        "hy": "Պատմություն"
    },
    "button_request": {
        "en": "Request for portfolio and Certification",
        "ru": "Запрос на портфолио и сертификацию",
        "hy": "Պորտֆոլիոյի և սերտիֆիկացման հարցում"
    },
    "button_settings": {
        "en": "Settings",
        "ru": "Настройки",
        "hy": "Կարգավորումներ"
    },
    "button_user": {
        "en": "User",
        "ru": "Пользователь",
        "hy": "Օգտատեր"
    },
    "user_info_title": {
        "en": "User Information",
        "ru": "Информация о пользователе",
        "hy": "Օգտատերի տվյալներ"
    },
    "username": {
        "en": "Username",
        "ru": "Имя пользователя",
        "hy": "Օգտանուն"
    },
    "first_name": {
        "en": "First Name",
        "ru": "Имя",
        "hy": "Անուն"
    },
    "last_name": {
        "en": "Last Name",
        "ru": "Фамилия",
        "hy": "Ազգանուն"
    },
    "language_code": {
        "en": "Language",
        "ru": "Язык",
        "hy": "Լեզու"
    },
    "null_user":{
        "en": "Not specified",
        "ru": "Не указано",
        "hy": "Նշված չէ"
    },
    "request_btn_text":{
        "en": "Available commands:\n/get_portfolio → Request to create user’s portfolio\n/get_certification → Request to create user’s certification",
        "ru": "Доступные команды:\n /get_portfolio → Запрос на создание портфолио пользователя,\n /get_certification → Запрос на создание сертификации пользователя",
        "hy": "Հասանելի հրամաններ:\n /get_portfolio → Պահանջել օգտատիրոջ պորտֆոլիոյի ստեղծում,\n /get_certification → Պահանջել օգտատիրոջ հավաստագրի ստեղծում"
    },
    "help_cmd_btn_text": {
        "en": "Hello! I'm your **Practice Bot**, designed to help you with practical projects and enhance your learning journey.\n\nHere’s what I can do and what each button/command means:\n\n🤖 **`/start`**: This is your starting point! Use this command to begin interacting with the bot. If you're new, it'll help you register, and you can choose your preferred language (English, Russian, or Armenian) to continue our conversation.\n\n👤 **User (Кнопка)**: Click this button to instantly view all your saved profile information, including your username, first name, last name, and current language setting. It's a quick way to check your details.\n\n📚 **Projects (Кнопка)**: This button is your gateway to the world of practical tasks. Click it to get an overview of available projects, what they entail, and how you can get started. Soon, you'll be able to receive your first project right from here!\n\n📜 **History (Кнопка)**: Ever wonder what projects you've worked on? This button will show you your complete project history, including ongoing and finished tasks. Keep track of your progress and achievements!\n\n⚙️ **Settings (Кнопка)**: Here you'll find options to customize your bot experience. While under development, this section will eventually allow you to manage various preferences.\n\n🏆 **Request for portfolio and Certification (Кнопка)**: Ready to showcase your skills? Use this button to officially request your project portfolio and a certificate of completion for your hard work. We'll get back to you with the details!\n\n❓ **Help (Кнопка)**: You just clicked it! This button brings you right back to this comprehensive guide, offering all the information you need about me and my functionalities.\n\nFeel free to explore and learn. If you have any further questions, don't hesitate to ask!",
        "ru": "Привет! Я ваш **Practice Bot**, разработанный, чтобы помочь вам с практическими проектами и улучшить ваш процесс обучения.\n\nВот что я могу делать и что означает каждая кнопка/команда:\n\n🤖 **`/start`**: Это ваша отправная точка! Используйте эту команду, чтобы начать взаимодействие с ботом. Если вы новичок, она поможет вам зарегистрироваться, и вы сможете выбрать свой предпочтительный язык (английский, русский или армянский), чтобы продолжить наше общение.\n\n👤 **Пользователь (Кнопка)**: Нажмите эту кнопку, чтобы мгновенно просмотреть всю сохраненную информацию вашего профиля, включая ваше имя пользователя, имя, фамилию и текущие языковые настройки. Это быстрый способ проверить ваши данные.\n\n📚 **Проекты (Кнопка)**: Эта кнопка — ваш вход в мир практических заданий. Нажмите ее, чтобы получить обзор доступных проектов, узнать, что они включают, и как вы можете начать работу. Скоро вы сможете получить свой первый проект прямо отсюда!\n\n📜 **История (Кнопка)**: Хотите знать, над какими проектами вы работали? Эта кнопка покажет вам полную историю ваших проектов, включая текущие и завершенные задачи. Отслеживайте свой прогресс и достижения!\n\n⚙️ **Настройки (Кнопка)**: Здесь вы найдете опции для настройки работы бота. Пока находится в разработке, этот раздел в конечном итоге позволит вам управлять различными предпочтениями.\n\n🏆 **Запрос на портфолио и сертификацию (Кнопка)**: Готовы продемонстрировать свои навыки? Используйте эту кнопку, чтобы официально запросить ваше проектное портфолио и сертификат о завершении вашей усердной работы. Мы свяжемся с вами с деталями!\n\n❓ **Помощь (Кнопка)**: Вы только что нажали на нее! Эта кнопка возвращает вас к этому всеобъемлющему руководству, предлагая всю необходимую информацию обо мне и моих функциях.\n\nНе стесняйтесь исследовать и учиться. Если у вас возникнут дополнительные вопросы, не стесняйтесь спрашивать!",
        "hy": "Բարև! Ես ձեր **Practice Bot**-ն եմ՝ նախագծված օգնելու ձեզ գործնական նախագծերի և ուսուցման գործընթացում:\n\nԱհա թե ինչ կարող եմ անել և ինչ է նշանակում յուրաքանչյուր կոճակ/հրաման:\n\n🤖 **`/start`**: Սա ձեր մեկնարկային կետն է: Օգտագործեք այս հրամանը՝ բոտի հետ փոխգործակցությունը սկսելու համար: Եթե նոր եք, այն կօգնի ձեզ գրանցվել, և դուք կկարողանաք ընտրել ձեր նախընտրելի լեզուն (անգլերեն, ռուսերեն կամ հայերեն)՝ մեր զրույցը շարունակելու համար:\n\n👤 **Օգտատեր (Կոճակ)**: Սեղմեք այս կոճակը՝ ձեր պահպանված պրոֆիլի բոլոր տեղեկությունները անմիջապես դիտելու համար, ներառյալ ձեր օգտանունը, անունը, ազգանունը և ընթացիկ լեզվի կարգավորումը: Սա արագ միջոց է ձեր տվյալները ստուգելու համար:\n\n📚 **Նախագծեր (Կոճակ)**: Այս կոճակը ձեր դարպասն է դեպի գործնական առաջադրանքների աշխարհ: Սեղմեք այն՝ հասանելի նախագծերի, դրանց բովանդակության և դրանք սկսելու մասին ակնարկ ստանալու համար: Շուտով դուք կկարողանաք ստանալ ձեր առաջին նախագիծը հենց այստեղից:\n\n📜 **Պատմություն (Կոճակ)**: Երբևէ մտածե՞լ եք, թե ինչ նախագծերի վրա եք աշխատել: Այս կոճակը ձեզ ցույց կտա ձեր նախագծերի ամբողջական պատմությունը, ներառյալ ընթացիկ և ավարտված առաջադրանքները: Հետևեք ձեր առաջընթացին և ձեռքբերումներին:\n\n⚙️ **Կարգավորումներ (Կոճակ)**: Այստեղ դուք կգտնեք ձեր բոտի փորձը հարմարեցնելու տարբերակներ: Թեև մշակման փուլում է, այս բաժինը, ի վերջո, թույլ կտա ձեզ կառավարել տարբեր նախապատվություններ:\n\n🏆 **Պորտֆոլիոյի և սերտիֆիկացման հարցում (Կոճակ)**: Պատրա՞ստ եք ցուցադրել ձեր հմտությունները: Օգտագործեք այս կոճակը՝ ձեր նախագծային պորտֆոլիոն և ձեր քրտնաջան աշխատանքի ավարտական հավաստագիրը պաշտոնապես հայցելու համար: Մենք կկապնվենք ձեզ հետ մանրամասների համար:\n\n❓ **Օգնություն (Կոճակ)**: Դուք հենց նոր սեղմեցիք այն: Այս կոճակը ձեզ անմիջապես կվերադարձնի այս համապարփակ ուղեցույցին, որն առաջարկում է ինձ և իմ գործառույթների մասին անհրաժեշտ բոլոր տեղեկությունները:\n\nԱզատորեն ուսումնասիրեք և սովորեք: Եթե ունեք լրացուցիչ հարցեր, մի հապաղեք հարցնել:"
    }
}